#кортеж - неизменяемый список
#поддерживают
#index(), count(), len(), sum(), min() и max();
#срезы;
#оператор принадлежности in;
#операторы конкатенации (+) и повторения (*).
#НЕ поддерживают
#append(), remove(), pop(), insert(), reverse(), sort()
#Варианты создания кортежа
a = (3,8,5,7)
b = (5,)
с = ()
print(tuple([1,2,3]))
print(tuple("hello"))
print(list((1,2,3)))#преобразовать кортеж в список

#срезы и индексация работают как у списков
print(a[0])#3
print(a[-1])#7
print(a[:2])#3 5
print(a[-2:])
#a[0]=5 выдаст ошибку

#список кортежей
a = [(4,3),(5,7), (1,),(1,3)]



#объеденить список кортежей в один кортеж
b=()
for i in range(len(a)):
    b+=a[i]
print(b)


#изменить кортеж при помощи срезов (вставить 2 между 1 и 3)
a = (1,3,5)
b =  (a[0],)+(2,)+a[-2:]
print(b)


#заменить на 1 первые элементы кортежей
a = [(10, 20, 40), (40, 50, 60), (10, 90), (5, 6, 10, 2, 1, 77)]

for i in range(len(a)):
    a[i]=(1,)+a[i][1:]
print(a)





